src/base/InformationRegisters/ДевБаттл_Результаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ДевБаттл_Результаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотраченоВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерРаунда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/base/InformationRegisters/ДевБаттл_ТекущееСостояниеИгрока.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ДевБаттл_ТекущееСостояниеИгрока</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДевБаттл_СостояниеИгрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/base/Enums/ДевБаттл_СостояниеИгрока.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>ДевБаттл_СостояниеИгрока</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачалоИгры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоРаунда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспытаниеОдиночное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспытаниеОдновременное</Name>
					<Comment>Испытание выполняется одновременно всеми</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатИспытания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонецИгры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатИспытанияВыполнено</Name>
					<Comment>Устанавливается ведущим</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатИспытанияПровалено</Name>
					<Comment>Устанавливается ведущим</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/base/CommonModules/ДевБаттл_ОбщегоНазначенияВызовСервера/Ext/Module.bsl
Процедура ИнициализацияПользователей() Экспорт
	Если ЗначениеЗаполнено(ИмяПользователя()) 
			И Не РольДоступна("ПолныеПрава") Тогда
		
		Возврат;
		
	КонецЕсли;
	// Инициализация пользователей
	
	// Администратор
	ПроверитьСоздатьПользователя("Администратор", "Администратор", "ПолныеПрава");
	
	// Игроки
	ПроверитьСоздатьПользователя("Игрок1", "Первый игрок", 		"ДевБаттл_Игрок");
	ПроверитьСоздатьПользователя("Игрок2", "Второй игрок", 		"ДевБаттл_Игрок");
	ПроверитьСоздатьПользователя("Игрок3", "Третий игрок", 		"ДевБаттл_Игрок");
	ПроверитьСоздатьПользователя("Игрок4", "Четвертый игрок", 	"ДевБаттл_Игрок");
	ПроверитьСоздатьПользователя("Игрок5", "Пятый игрок", 		"ДевБаттл_Игрок");
	ПроверитьСоздатьПользователя("Игрок6", "Шестой игрок", 		"ДевБаттл_Игрок");

	
КонецПроцедуры

Процедура ПроверитьСоздатьПользователя(Имя, ПолноеИмя, Роль)
	
	Если ПользователиИнформационнойБазы.НайтиПоИмени(Имя) = Неопределено Тогда
		
		Юзер = ПользователиИнформационнойБазы.СоздатьПользователя();
		Юзер.Имя = Имя;
		Юзер.ПолноеИмя = ПолноеИмя;
		Юзер.Роли.Добавить(Метаданные.Роли.Найти(Роль));
		Юзер.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗафиксироватьРезультатИспытания(ИмяИгрока, Выполнено, ПотраченоВремени) Экспорт
	
	Запись = РегистрыСведений.ДевБаттл_Результаты.СоздатьМенеджерЗаписи();
	
	Запись.Игрок = ИмяИгрока;
	Запись.НомерРаунда = Константы.ДевБаттл_Раунд.Получить();
	
	Запись.Выполнено = Выполнено;
	Запись.ПотраченоВремени = ПотраченоВремени;
	
	Запись.Записать(Истина);	          
	
	Запись = РегистрыСведений.ДевБаттл_ТекущееСостояниеИгрока.СоздатьМенеджерЗаписи();
	Запись.Игрок = ИмяИгрока;
	Запись.Состояние = Перечисления.ДевБаттл_СостояниеИгрока.РезультатИспытания;
	Запись.Записать(Истина);	
	
КонецПроцедуры

Функция ПацанскаяЦитата() Экспорт
	
	Цитатник = ПолучитьОбщийМакет("ДевБаттл_Цитатник");
	Высота = Цитатник.ВысотаТаблицы;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	Номер = ГСЧ.СлучайноеЧисло(1, Высота);
	
	Возврат Цитатник.Область(Номер, 1).Текст;
	
КонецФункции
